DiamBajoPresAlta/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type zeroGradient;
    }

    outletLeft
    {
        type zeroGradient;
    }

    outletRight
    {
        type zeroGradient;
    }

    wall
    {
        type noSlip;
    }

    aneurysm
    {
        type noSlip;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}

// ************************************************************************* //
