DiamBajoPresAlta/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    inlet
    {
        type fixedValue;
	value uniform 22.64; // Kinematic pressure = 24000/ 1060
    }

    outletLeft
    {
        type fixedValue;
        value uniform 22.26;
    }

    outletRight
    {
        type fixedValue;
        value uniform 22.2642;
    }

    wall
    {
        type zeroGradient;
    }

    aneurysm
    {
        type zeroGradient;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}

// ************************************************************************* //
